# Gemini Integration - DevLevelUp

## Обзор
Приложение использует существующую интеграцию с Gemini для генерации адаптивных вопросов и анализа ответов пользователей на их родном языке.

## Настройка Gemini API

### 1. Получение API ключа
1. Перейдите в [Google AI Studio](https://makersuite.google.com/app/apikey)
2. Создайте новый API ключ для Gemini
3. Скопируйте ключ

### 2. Настройка в Python backend
В файле `python/devlevelup/services.py` уже настроена интеграция с Gemini:

```python
class GeminiService:
    def __init__(self):
        self.mock_mode = os.getenv("GEMINI_API_KEY") is None
        if not self.mock_mode:
            genai.configure(api_key=os.environ.get("GEMINI_API_KEY"))
```

### 3. Переменные окружения
Установите переменную окружения:

```bash
export GEMINI_API_KEY=your-gemini-api-key-here
```

Или в файле `.env`:
```
GEMINI_API_KEY=your-gemini-api-key-here
```

## Возможности Gemini

### 1. Генерация вопросов
- **Адаптивность**: Вопросы генерируются на основе цели пользователя через `get_skills_for_goal()`
- **Язык**: Все вопросы на языке пользователя (английский/русский)
- **Сложность**: Адаптируется под уровень опыта
- **Персонализация**: Учитывает конкретную цель обучения

### 2. Анализ ответов
- **Балансировка навыков**: Обновляет уровень в реальном времени через `analyze_and_conclude_assessment()`
- **Инсайты**: Генерирует персональные наблюдения
- **Сильные стороны**: Выявляет области экспертизы
- **Области роста**: Определяет что нужно улучшить

### 3. Рекомендации
- **Персонализированные**: На основе анализа ответов через `generate_learning_plan()`
- **Конкретные**: Практические советы по обучению
- **Целеориентированные**: Связаны с целью пользователя

## Примеры работы Gemini

### Генерация вопросов
**Входные данные:**
- Цель: "Хочу стать Frontend разработчиком"
- Язык: "ru"

**Результат через `get_skills_for_goal()`:**
```json
{
  "skills": [
    {
      "name": "HTML/CSS",
      "group": "Frontend Development"
    },
    {
      "name": "JavaScript",
      "group": "Frontend Development"
    }
  ],
  "primary_skill": "Frontend Development"
}
```

**Результат через `get_next_question()`:**
```json
{
  "type": "multiple-choice",
  "question": "Насколько вы знакомы с HTML и CSS?",
  "options": ["A", "B", "C", "D"],
  "correct_answer": "C"
}
```

### Анализ ответов
**Входные данные:**
- История ответов пользователя
- Название навыка

**Результат через `analyze_and_conclude_assessment()`:**
```json
{
  "final_level": "Beginner",
  "final_score": 65,
  "insights": [
    "У вас базовые знания HTML/CSS, но нужна практика"
  ],
  "recommendations": [
    "Практикуйтесь с простыми проектами",
    "Изучите CSS Grid и Flexbox"
  ]
}
```

## Fallback система

Если Gemini недоступен, приложение использует:
- Mock режим в `GeminiService` с предопределенными данными
- Предопределенные вопросы на нужном языке
- Простой анализ ответов
- Базовые рекомендации

## Мониторинг и отладка

### Логирование
В Python backend уже настроено логирование:

```python
# В services.py
print(f"!!! REAL ERROR in StartSkillTestUseCase: {e}")
print("--- MOCK MODE: Returning mock next question ---")
```

### Обработка ошибок
Все вызовы Gemini обернуты в try-catch с fallback на mock данные.

## Стоимость API

### Gemini 1.5 Flash
- **Бесплатно**: до 15 запросов в минуту
- **Платно**: $0.075 за 1M входных токенов, $0.30 за 1M выходных токенов
- **Примерная стоимость**: $0.001-0.005 за одного пользователя

### Оптимизация
- Используйте mock режим для разработки
- Кэшируйте результаты для похожих целей
- Ограничьте количество токенов в запросах

## Безопасность

1. **Никогда не коммитьте API ключи** в репозиторий
2. Используйте переменные окружения
3. Ограничьте доступ к API ключам
4. Мониторьте использование API

## Следующие шаги

1. Настройте API ключ Gemini
2. Протестируйте генерацию вопросов
3. Проверьте анализ ответов
4. Настройте мониторинг использования
5. Оптимизируйте промпты для лучших результатов
